{"podcast_details": {"podcast_title": "Mashley at the Movies", "episode_title": "Mashley Movie Trivia # 4", "episode_image": "https://storage.buzzsprout.com/variants/c1KbyLuV9cDXMdwWAXGya66L/f6fd9b4ca4e468e7e11c8350463c894b252ee834d352e0a8d889b97ac83aedef?.jpg", "episode_transcript": " Hello and welcome to another edition of Mashlee at the movies movie trivia. Hey everyone, I'm Matt. I'm Ashley. We are joined again by our friend Ryan. Hi Ryan. Hi guys, thanks for having me. Thank you for joining us and thank you for being willing to be a contestant on our trivia show. I think this is our fourth trivia episode that we've done. I'll mention real quick, Ryan is a great guy to talk with about movies. He's a great guy in general. But if you want to read his thoughts on movies, you can go to his website, ArnoldReviews.weebly.com. He's also found on Twitter at Arnold underscore at movies. But yeah, Ryan, so today, as in all of our previous trivia episodes, we've got 15 questions to pose to you about movies, the general knowledge. And so Ashley will be keeping score. Yes. And without further ado, everyone, let's give a big round of applause for Ryan. Okay. All right. Question one. Ethan Hawke and Julie Delpy co-starred in a film trilogy together. Name the movies and in the order of their release. That would be the before trilogy, which is before sunrise, before sunset and before midnight. That's correct. Yeah. You want to name the year too or is that okay? No, no, I was going to name the years a little bit. You don't have to. Yeah. Before sunrise was 1995. Before sunset 2004 and before midnight 2013. So yeah, good job, Ryan. You're one and oh. So yeah. Question two, what was the last movie that Charlie Chaplin directed and had a role in? I know you're a Charlie Chaplin fan. I am a big Charlie Chaplin fan. I believe it was Limelight was his last one. I'm not totally for sure. Incorrect, I'm afraid. It was Accountus from Hong Kong, 1967. Never heard of that movie. I actually have not seen that one. So I add that to my list. I don't know how good it is. Yeah, Limelight was very close to that though. I knew it was at the end of his career. Yeah. All right. Question three, what is the last line of the 1959 classic Some Like It Hot? Oh. Is it a boat? Jack Lemmon says something and then Joe E. Brown, who sits next to him, says the last one. I know. I'm trying to think. He says we all are a little. All right. Time you up. Yeah. I have it in my head. I just can't think of it. All a little strange or something like that or a little weird. Or he says something along the lines of like, it doesn't bother me that he's a man. Nobody's perfect. Nobody's perfect. All right. So so far, Ryan's one and two. Now moving on. You just warm it up. Question four, what is the name of the character who runs the bathhouse in Spirited Away? I remember in the English dubbed version, Suzanne Plachette was the voice of that. I remember when we I can recognize her voice when we saw it in the theater back in the day. Anyway, yeah. We talk about the witch, Obama. Yeah, Obama. Yeah. You got it. Awesome. OK. Good job, Ryan. So question five, what is the name of the character played by Denholm Elliott in Raiders of the Last Ark and Indiana Jones of the Last Crusade? So we're recording this on the eve of the new Indiana Jones movie coming out. And I know, Ryan, you've been I think you rewatched all four previous ones very recently. So I thought, OK, Ryan, I'll get this. Oh, oh, that would be Marcus, right? Marcus. Yeah. You have the last name. I don't know. Marcus is last name. Marcus. All right. It's a Marcus Brody is the name of the character. Yeah. Yeah. Good. That's good. That's actually all right. I should keep the score there. OK. Question six kind of moves along from that. Where did Henry Jones Senior played by Sean Connery say that Marcus Brody once got lost? Where did Marcus Brody once get lost? Ryan's thinking. It's on the tip of his tongue. I feel like he said it was something along the lines of like, yeah, I lost his own house, but I feel I'm not sure if that's correct. I'll go with it. Very close. Very close. Can't give it to you. Yeah, it's fine. But it's once got lost in his own museum. Museum. That was my second guess. It was something very, you know, somewhere somebody should not get lost and Marcus got lost. So OK. Next question is question seven. It's about one of the I think one of your favorite directors. Name three of the four feature films directed by Chloe Zhao as of the time of this recording mid 2023. She's directed four movies. Name three of them. Yeah, I can do The Rider, Nomadland and Eternals. And then her first debut feature was I was I'm spacing the name of it, but it was the one that was on the Indian Preserve. Song of My Brother's Taught Me. Song of My Brother's Taught Me. Yeah, that was it. All right. Yeah, that's all right. All righty. Question eight. So, yeah, OK, I had fun with this. What film should have won the best picture Oscar for 2005? Oh, Brokeback Mountain. That is correct. That is correct. And unfortunately, Crash took it. Yeah. So I included that as kind of a joke, but a real question. But one, it's an opinion I've long held. And two, I know when I looked at your diary and trans letterbox for Brokeback Mountain, that's basically what you wrote. So we're in agreement on that. So how many he's got right? Four. Four. All right. Four, eight down. So you're doing 50-50 here. Yeah, not bad. We got 15 total. So we're on to question nine. You'll get this is easy. So X and Pearl are the first two films in Ty West's horror trilogy starring Mia Goth. What is the name of the forthcoming third movie? Oh, that's Maxine with three Xs. You are correct. OK, great job. Question 10. 2008's vampire film Let the Right One In is set in a suburb of which city? It's a little bit northern hemisphere. It's a Swedish film. You're close there. You've got the country. Suburb of what city in Sweden? What's a well-known city in Sweden? I do not know, unfortunately. I know it's a Swedish film, but I don't know. It's set in a suburb of Stockholm. Stockholm. Yeah. OK. I saw on your letterbox that this is one of your favorite movies or favorite horror movies, one of the two. It's not the right one yet. That's a very good Swedish movie, but did not remember the name of the city. All right. So going a little far back, 40 years ago. So I guess that's sort of a clue. But E.T. the Extraterrestrial, The Thing, Star Trek II, The Wrath of Khan, Blade Runner, and Tron were sci-fi films all released in which year? 1982. Awesome. Great job. You are correct. OK. So question 12. Humphrey Bogart and Peter Laurie starred in five films together. Name two of them. Casablanca is being won. Correct. I'm going to say, is it The Maltese Falcon? Yes. You are correct. Great job. The other three are Passage to Marseille, Beat the Devil, and All Through the Night. I have not seen any of those three. I've seen Casablanca, The Maltese Falcon. Yeah. All right. Just three more. Question 13. Bo Burnham, one of your favorites. Bo Burnham had a role in a 2017 movie starring Kumail Nanjiani and Zoe Kazan. What is the title of that movie? That is The Big Sick. You are correct. Awesome. Very good movie, by the way. It is, yes. All right. Question 14. Jack Lemmon starred as C.C. Baxter in which movie? Oh, The Apartment. Yes. I know it's one of your favorite films. It's a great movie. Yeah. Recently favorite. I just actually, believe it or not, watched The Apartment last year. I've watched it several times since then and it went up in the ranking because it's very well made. Yeah. I agree. Finally, here we are at the big climax. Question 15. It's about one of your favorite directors. Please name the four feature films directed by Stanley Kubrick that were released in the 1960s. What four films did Kubrick direct that were released in the 1960s? He came out with 2001 Space Odyssey, Lolita, and Spartacus. That's three. Yeah. Don't worry. You've got the fourth one. I know you do. Or maybe not. Was it The Killing? Was it the 50s? I'm just going to go with The Killing. It has Peter Sellers in it in multiple roles. Oh, Dr. Strangelove. I spaced Dr. Strangelove. I knew The Killing was in the 50s. Yeah. That's why I said don't worry because that's the subtitle that is like, you know. Don't worry about it. I didn't catch that reference. I'll just give that to him. Okay. Ashley, our official score. Ashley is going to tabulate and tell us how many of the 15 questions Ryan got right. I count 11 correct. That is not bad, Ryan. That is good. That is pretty good. Very good. Thank you for being willing to. To sit through that. Yeah. So, that's another episode of our MASHLY movie trivia. See you all next time when we have another contestant in the hot seat. Until then, Ryan, thank you again for joining us. Thank you guys for having me. And thank you all for listening. Thank you."}, "podcast_summary": "In this episode of Mashly at the Movies Movie Trivia, the host, Matt and Ashley, are joined by their friend Ryan as a contestant. They ask Ryan a series of movie-related questions, including identifying film trilogies, last movies directed by Charlie Chaplin, and the last line of Some Like It Hot. Ryan answers most of the questions correctly, demonstrating his knowledge of movies and filmmakers like Chloe Zhao and Stanley Kubrick. Overall, Ryan answers 11 out of 15 questions correctly, impressing the hosts and proving his love for film.", "podcast_guest": {"name": "Ryan", "org": "ArnoldReviews", "title": "", "summary": "Arnold Alois Schwarzenegger (born July 30, 1947) is an Austrian and American actor, businessman, filmmaker, politician, and former professional bodybuilder best known for his roles in high-profile action movies. He served as the 38th governor of California from 2003 to 2011 and was among Time magazine's 100 most influential people in the world in 2004 and 2007.Schwarzenegger began lifting weights at age 15 and won the Mr. Universe title aged 20, and subsequently the Mr. Olympia title seven times. He is widely regarded as one of the greatest bodybuilders of all time, and has written many books and articles about it. The Arnold Sports Festival, considered the second-most important bodybuilding event after Mr. Olympia, is named after him. He appeared in the bodybuilding documentary Pumping Iron (1977). He retired from bodybuilding and gained worldwide fame as a Hollywood action star, with his breakthrough in the sword and sorcery epic Conan the Barbarian (1982), a box-office hit with a sequel in 1984. After playing the title character in the science fiction film The Terminator (1984), he starred in Terminator 2: Judgment Day (1991) and three other sequels. His other successful action films included Commando (1985), The Running Man (1987), Predator (1987), Total Recall (1990), and True Lies (1994), in addition to comedy films such as Twins (1988), Kindergarten Cop (1990) and Jingle All the Way (1996). He is the founder of the film production company Oak Productions.As a registered Republican, Schwarzenegger chaired the President's Council on Physical Fitness and Sports during most of the George H. W. Bush administration. On October 7, 2003, he was elected Governor of California in a special recall election to replace then-Governor Gray Davis. He received 48.6% of the vote, 17 points ahead of Democrat runner-up Cruz Bustamante. He was sworn in on November 17 to serve the remainder of Davis' term, and was reelected in the 2006 California gubernatorial election with an increased vote share of 55.9% to serve a full term. In 2011 he reached his term limit as governor and returned to acting.\nSchwarzenegger was nicknamed the \"Austrian Oak\" in his bodybuilding days, \"Arnie\" or \"Schwarzy\" during his acting career, and \"the Governator\" (a portmanteau of \"Governor\" and \"Terminator\") during his political career. He married Maria Shriver, a niece of President John F. Kennedy, in 1986. They separated in 2011 after he admitted to having fathered a child with their housemaid in 1997; their divorce was finalized in 2021."}, "podcast_highlights": "In this podcast episode of Mashley at the Movies Movie Trivia, the hosts, Matt and Ashley, are joined by their friend Ryan as a contestant. They ask Ryan 15 movie-related questions and keep score of his answers. Some of the key points include:\n\n1. Ethan Hawke and Julie Delpy co-starred in the Before Trilogy, consisting of Before Sunrise (1995), Before Sunset (2004), and Before Midnight (2013).\n2. Ryan incorrectly guesses Charlie Chaplin's last directed and acted movie as Limelight, but it was actually Accountus from Hong Kong (1967).\n3. Ryan struggles to remember the last line of Some Like It Hot (1959), which is \"Nobody's perfect.\"\n4. Ryan correctly answers the question about the character who runs the bathhouse in Spirited Away, which is Yubaba.\n5. Ryan correctly identifies the character played by Denholm Elliott in Raiders of the Lost Ark and Indiana Jones and the Last Crusade as Marcus Brody.\n6. Ryan remembers that Marcus Brody got lost in his own museum in the Indiana Jones films.\n7. Ryan successfully names three of the four feature films directed by Chloe Zhao. They are The Rider, Nomadland, and Eternals. The fourth film is Song My Brother's Taught Me.\n8. Ryan correctly answers that Brokeback Mountain should have won the Best Picture Oscar in 2005, but it lost to Crash.\n9. Ryan knows that Maxine is the forthcoming third movie in Ty West's horror trilogy starring Mia Goth.\n10. Ryan is unable to recall that Let the Right One In (2008) is set in a suburb of Stockholm, Sweden.\n11. Ryan correctly identifies 1982 as the year in which E.T. the Extraterrestrial, The Thing, Star Trek II: The Wrath of Khan, Blade Runner, and Tron were all released.\n12. Ryan successfully names two of the five films in which Humphrey Bogart and Peter Lorre starred together: Casablanca and The Maltese Falcon.\n13. Ryan knows that Bo Burnham had a role in The Big Sick (2017) starring Kumail Nanjiani and Zoe Kazan.\n14. Ryan confidently answers that Jack Lemmon starred as C.C. Baxter in The Apartment.\n15. Ryan correctly lists the four Stanley Kubrick films released in the 1960s: 2001: A Space Odyssey, Lolita, Spartacus, and Dr. Strangelove or How I Learned to Stop Worrying and Love the Bomb.\n\nOverall, Ryan answers 11 of the 15 questions correctly, making him a talented participant in the movie trivia game."}